Hustle version 0.1.0
|    a|
|   54|
|   13|
|    0|
|  240|
|  137|
|  220|
|  245|
|  160|
|  220|
|   86|
|  103|
|   62|
|  208|
|  166|
|  138|
|   69|
|   51|
|  241|
|   89|
|  215|
|   47|
|    7|
|  136|
|  110|
|   76|
|  145|
|    8|
|   30|
|   87|
|  201|
hustle> 
hustle> 
Hustle version 0.1.0
|    a|    b|
|   54|  185|
|   13|   40|
|    0|    7|
|  240|   82|
|  137|   40|
|  220|  119|
|  245|  187|
|  160|  216|
|  220|   82|
|   86|  209|
|  103|  185|
|   62|  233|
|  208|   59|
|  166|  134|
|  138|   55|
|   69|   61|
|   51|  108|
|  241|  129|
|   89|  197|
|  215|   64|
|   47|  222|
|    7|  119|
|  136|  150|
|  110|  116|
|   76|  109|
|  145|   53|
|    8|   77|
|   30|  201|
|   87|  190|
|  201|  145|
hustle> 
hustle> 
Hustle version 0.1.0
|MIN(a)|
|    0|
hustle> 
hustle> 
Hustle version 0.1.0
|MAX(a)|
|  245|
hustle> 
hustle> 
Hustle version 0.1.0
|SUM(a)|
| 3564|
hustle> 
hustle> 
Hustle version 0.1.0
|COUNT(a)|
|   30|
hustle> 
hustle> 
Hustle version 0.1.0
hustle> Parser: SELECT b FROM t WHERE a=54;
:1.1: expression terms not yet supported
Falling back on Quickstep parser/resolver...
|    b|
|  185|
hustle> 
Hustle version 0.1.0
hustle> Parser: SELECT a FROM t WHERE b>36;
:1.1: expression terms not yet supported
Falling back on Quickstep parser/resolver...
|    a|
|   54|
|   13|
|  240|
|  137|
|  220|
|  245|
|  160|
|  220|
|   86|
|  103|
|   62|
|  208|
|  166|
|  138|
|   69|
|   51|
|  241|
|   89|
|  215|
|   47|
|    7|
|  136|
|  110|
|   76|
|  145|
|    8|
|   30|
|   87|
|  201|
hustle> 
Hustle version 0.1.0
|SUM(b)|
|  129|
|   40|
|  185|
|    7|
|  150|
|  116|
|   59|
|   53|
|  145|
|  185|
|   82|
|   77|
|  201|
|  216|
|   64|
|  190|
|  233|
|   55|
|  109|
|   61|
|  197|
|  209|
|  187|
|  119|
|  222|
|  201|
|   40|
|  108|
|  134|
hustle> 
hustle> 
Hustle version 0.1.0
hustle> 
Resolver: unsupported top-level node type: 0
Falling back on Quickstep parser/resolver...
hustle> 
Hustle version 0.1.0
hustle> Parser: INSERT INTO test_table VALUES(1, 1, 1.0);
:1.1: expression terms not yet supported
Falling back on Quickstep parser/resolver...
hustle> 
Hustle version 0.1.0
hustle> Parser: INSERT INTO test_table VALUES(2, 1, 1.0);
:1.1: expression terms not yet supported
Falling back on Quickstep parser/resolver...
hustle> 
Hustle version 0.1.0
hustle> Parser: INSERT INTO test_table VALUES(3, 1, 1.0);
:1.1: expression terms not yet supported
Falling back on Quickstep parser/resolver...
hustle> 
Hustle version 0.1.0
hustle> Parser: INSERT INTO test_table VALUES(4, 1, 1.0);
:1.1: expression terms not yet supported
Falling back on Quickstep parser/resolver...
hustle> 
Hustle version 0.1.0
hustle> Parser: INSERT INTO test_table VALUES(5, 1, 1.0);
:1.1: expression terms not yet supported
Falling back on Quickstep parser/resolver...
hustle> 
Hustle version 0.1.0
hustle> Parser: SELECT * FROM test_table;
:1.1: SELECT *  not yet supported
Falling back on Quickstep parser/resolver...
| col1| col2| col3|
|    1|    1|    1|
|    2|    1|    1|
|    3|    1|    1|
|    4|    1|    1|
|    5|    1|    1|
hustle> 
